
import 'package:flutter/material.dart';
import 'package:toyproject/_core/constants/move.dart';
import 'package:toyproject/ui/pages/customer_page/widget/icon_and_title.dart';
import 'package:toyproject/ui/widget/arrow_app_bar.dart';

class TermsAndConditionsPage extends StatelessWidget {
  const TermsAndConditionsPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: ArrowAppBar(leading: Icons.keyboard_backspace, title: '이용약관',
          moveRoute: (){
            Navigator.pop(context);
            // Navigator.pushNamed(context, Move.TermsOfService);
          }
      ),
      body: SingleChildScrollView(
        child: Column(
          children: [
            SizedBox(height: 20.0,),
            Padding(
              padding: const EdgeInsets.symmetric(horizontal: 40.0),
              child: Container(
                alignment: Alignment.centerLeft,
                child: Text('서비스 이용약관',
                  style: TextStyle(fontWeight: FontWeight.bold, fontSize: 24.0),
                ),
              ),
            ),
            SizedBox(height: 40.0,),
            Padding(
              padding: const EdgeInsets.symmetric(horizontal: 40.0),
              child: Text(
'''
제 1 조(목적)
이 약관은 유한회사 미소(이하 "당사"라 한다)가 운영, 제공하는 인터넷 웹사이트(이하 “웹사이트”라 합니다) 및 모바일 어플리케이션(이하 “앱”이라 합니다)에서 제공하는 모든 서비스(이하 “미소 서비스”라 합니다)를 이용함에 있어 당사와 회원의 권리, 의무 및 책임사항을 규정함을 목적으로 합니다.

제 2 조(정의)
이 약관에서 사용하는 용어의 정의는 아래와 같고, 본 조에서 정하는 것을 제외하고는 서비스 화면상 안내, 운영정책, 관계 법령 및 기타 일반적인 상관례에 의합니다.

1. "회원"이라 함은 이 약관에 따라 당사에 개인정보를 제공하여 회원등록을 한 자로서, 당사와 이용계약을 체결하여 당사가 제공하는 무료서비스와 유료서비스를 이용하는 자를 말합니다. 회원은 고객과 파트너로 구분됩니다.

2. “고객”은 일감 또는 견적 요청에 대한 정보를 제공하는 회원을 말합니다.

3. “파트너”는 일감 또는 견적 요청에 대한 정보를 제공받고자 하는 회원을 말합니다.

4. “미소서비스”라 함은 웹사이트 및 앱에서 당사가 제공하는 모든 서비스를 말합니다.

5. “홈서비스”라 함은 파트너가 고객에게 제공하는 모든 서비스(가사도우미 서비스, 이사 서비스 등)를 말합니다.

6. "무료서비스"라 함은 회원과 회원이 매칭되기 위하여 당사에 대금을 지급하지 않고 이용할 수 있는 모든 서비스를 말합니다.

7. "유료서비스"라 함은 구인 또는 구직을 위한 사이트 결제 및 기타 상품(온라인 콘텐츠 포함)의 유료 제공 및 결제 처리를 위한 제반 서비스를 말합니다.

8. “자동결제”라 함은 회원이 웹사이트 또는 앱에 신용카드/체크카드 등 결제수단을 등록한 이후 자동으로 결제가 진행되는 것을 말합니다.

9. "견적"이라 함은 "고객"의 요청에 따라 "파트너"가 제공할 수 있는 용역의 내용, 가격 그리고 용역 역량에 관한 정보를 말합니다.

10. "구인 수수료"라 함은 당사의 "파트너" 중개의 반대급부로써 "고객"에게 지급받는 금원을 말합니다.

11. "구직 수수료"라 함은 당사의 "고객" 중개 또는 "견적" 응찰 기회의 반대급부로써 "파트너"에게 지급받는 금원을 말합니다.

12. "예치금"이라 함은 "회원"이 "유료서비스" 이용을 위해 당사에 선급으로 예치한 금원을 말합니다.

13. "무상 예치금"이라 함은 당사가 "회원"에게 무상으로 제공하는 "예치금"을 말합니다.

14. "쿠폰"이라 함은 당사가 "회원"에게 제공하는 특정 조건의 "유료서비스" 할인권을 말합니다.

15. “매칭”이란, "고객"과 "파트너"를 중개하여 연결되는 것을 말합니다.

제 3 조(약관의 명시와 개정)
1. 당사는 이 약관의 내용과 당사의 상호, 영업소 소재지, 대표자의 성명, 사업자등록번호, 연락처 등을 회원이 알 수 있도록 웹사이트 및 앱 초기 화면에 게시합니다. 다만, 약관의 내용은 이용자가 연결화면을 통하여 볼 수 있도록 할 수 있습니다.

2. 당사는 관련 법령을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.

3. 당사가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행 약관과 함께 당사 홈페이지의 초기화면에 그 적용일자 7일 이전부터 적용일자 전일까지 공지합니다. 다만, 회원에게 불리하게 약관내용을 변경하는 경우에는 최소한 30 일 이전의 유예기간을 두고 공지하고, 회원에게 SMS, 모바일 애플리케이션 등 적절한 방법으로 개별 통지합니다. 이 경우 당사는 개정 전 내용과 개정 후 내용을 명확하게 비교하여 회원이 알기 쉽도록 표시합니다.

4. 회원은 개정된 약관이 공지된 지 15일 이내에 거부의사를 표명할 수 있습니다. 회원이 개정된 약관에 대한 거부의사를 표명하는 경우 당사는 15일의 기간을 정하여 회원에게 사전 통지 후 당해 회원과의 계약을 해지할 수 있습니다. 만약, 회원이 거부의사를 표시하지 않고 서비스를 계속 이용하는 경우에는 개정된 약관에 동의하는 것으로 간주합니다.

5. 회원이 변경된 약관의 내용에 동의하지 않는 경우 당사는 개정된 약관의 내용을 적용할 수 없으며, 이 경우 회원은 이용계약을 해지할 수 있습니다.

6. 당사는 개별 서비스 별로 별도의 약관(이하 “서비스 별 약관”이라 합니다)을 둘 수 있으며, 해당 내용이 이 약관과 상충할 경우 서비스 별 약관이 우선합니다.

7. 이 약관이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 「전자상거래 등에서의 소비자 보호에 관한 법률」, 「약관의 규제 등에 관한 법률」, 「전자상거래 등에서의 소비자보호 지침」 등 관련법령 또는 상관례에 따릅니다.

제 4 조(이용계약 및 회원가입)
1. 당사 서비스를 이용하고자 하는 자는 당사가 정한 서비스 신청 양식에 따라 정보를 기입한 후 이 약관 및 개인정보 수집 및 이용에 동의한다는 의사표시를 함으로써 이용계약과 회원가입의 신청을 합니다.

2. 당사는 제1항과 같이 회원으로 가입할 것을 신청한 회원 중 다음 각 호에 해당하지 않는 한 회원으로 등록합니다.

① 본인 실명이 아니거나 다른 사람의 명의를 사용하여 신청하였을 때

② 서비스 이용 계약 신청서의 내용을 허위로 기재하였을 때

③ 사회의 안녕과 질서 혹은 미풍양속을 저해할 목적으로 신청하였을 때

④ 부정한 용도로 본 서비스를 이용하고자 하는 경우

⑤ 기타 이용신청자의 귀책사유로 이용승낙이 곤란한 경우

3. 이용계약 및 회원가입은 당사가 제1항의 신청에 대한 승낙을 통지함으로써 성립합니다.

4. 19세 미만의 미성년자는 법정대리인의 동의가 있어야 이용계약 및 회원가입이 성립합니다.

제 5 조(서비스의 제공)
1. 서비스의 내용은 다음과 같습니다.

① 파트너와 고객 간 매칭 서비스

② 고객과 파트너 간 수수료 대금 지급(결제)대행 서비스

③ 맞춤화된 서비스 또는 일감 및 견적 요청의 안내/제공 서비스

④ 기타 관련된 부수적 서비스

2. 당사는 통신판매중개자로서 통신판매의 당사자가 아니며, 미소 서비스의 범위는 웹사이트 및 앱 상에서 고객과 파트너가 중개되거나 견적 요청 및 응찰 기회를 주는 것까지로 제한됩니다.

제 6 조(서비스의 이용 및 중단)
1. 당사의 서비스는 특별한 사정이 없는 한 연중무휴, 1일 24시간 이용할 수 있습니다.

2. 당사는 컴퓨터 등 정보통신설비의 보수 점검, 교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다.

3. 당사가 사업종목의 전환, 사업의 포기, 업체 간 통합 등의 이유로 서비스를 제공할 수 없게 되는 경우에는 제8조에서 정한 방법으로 회원에게 통지하고, 당초 웹사이트 및 앱에서 제시한 조건에 따라 회원에게 보상합니다.

제 7 조(회원탈퇴 및 자격 상실 등)
1. 회원은 당사에 언제든지 탈퇴를 요청할 수 있으며 당사는 즉시 회원탈퇴를 처리합니다. 다만 아래의 경우에는 해당하는 문제가 해결된 후 탈퇴 처리합니다.

① 이용예약이 취소 또는 완료되지 않은 경우

② 대금의 결제, 지급이 완료되지 않은 경우

③ 당사, 파트너, 고객 또는 제3자와 발생한 분쟁이 종료되지 않은 경우

2. 회원이 다음 각 호의 사유에 해당하는 경우, 당사는 회원자격을 제한 및 정지시킬 수 있으며, 이 경우 그 사유를 회원에게 지체 없이 통지합니다.

① 가입 신청 시에 허위 내용을 등록한 경우

② 당사의 인터넷 웹사이트 또는 모바일 어플리케이션을 통해 거래한 당사 서비스 이용에 관련하여 회원이 부담하는 채무를 기일에 지급하지 않는 경우

③ 다른 사람의 당사 서비스 이용을 방해하거나 그 정보를 도용하는 등 전자상거래질서를 위협하는 경우

④ 기타 다음과 같은 행위 등으로 당사의 건전한 운영을 해하거나 당사의 업무를 방해하는 경우

가. 당사의 운영에 관련하여 근거 없는 사실 또는 허위의 사실을 적시하거나 유포하여 당사의 명예를 실추시키고 당사의 신뢰성을 해하는 경우

나. 당사의 운영과정에서 직원에게 폭언 또는 음란한 언행을 하여 업무환경을 심각히 해하는 경우

다. 당사의 운영과정에서 이유 없는 잦은 연락이나 소란 또는 협박, 인과관계가 입증되지 않는 피해에 대한 보상(적립금, 현금, 상품)요구 등으로 업무를 방해하는 경우

라. 당사를 거치지 않고 파트너와 고객이 직거래를 하는 경우

마. 파트너가 서비스를 수행하기에 역량이 부족하거나 문제가 있을 경우

3. 당사가 회원 자격을 제한, 정지시킨 후 동일한 행위가 2 회 이상 반복되거나 30 일 이내에 그 사유가 시정되지 아니하는 경우 당사는 회원자격을 상실시키고, 그 사유를 지체 없이 통지합니다.

4. 당사가 회원자격을 상실시키는 경우에는 회원등록을 말소합니다. 이 경우 회원에게 이를 통지하고 회원등록 말소 전에 최소한 30 일 이상의 기간을 정하여 소명할 기회를 부여합니다.

제 8 조(회원에 대한 통지)
1. 당사가 회원에 대한 통지를 하는 경우, 전화나 메시지 그리고 어플리케이션을 통할 수 있습니다.

2. 당사는 불특정다수 회원에 대한 통지의 경우 1 주일이상 웹사이트 및 앱에 게시함으로서 개별 통지에 갈음할 수 있습니다. 다만, 회원 본인의 거래와 관련하여 중대한 영향을 미치는 사항에 대하여는 개별통지를 합니다.

제 9 조(대금의 지급)
1. 당사는 고객 또는 파트너는 유료 서비스 이용을 결정하면 신용/체크카드, 가상계좌 등 기타의 방법으로 거래 대금을 결제할 수 있는 방법을 제공합니다.

2. 당사는 고객과 파트너 간 매칭시 고객으로부터는 “구인수수료”를, 파트너로부터는 구직수수료”를 수취할 수 있고 카드수수료, 보험료 등이 포함될 수 있습니다(이하, 구인수수료와 구직수수료를 포괄하여 “중개수수료”라 합니다).

3. 당사가 고객과 파트너를 대신하여 거래대금을 지급받은 경우 거래대금에서 중개수수료를 공제한 금액을 정산하여 지급합니다.

4. 제2항에서 명시한 구직수수료는 파트너의 서비스와 신뢰도, 당사의 서비스 제공 정책에 따라 변동 될 수 있습니다.

5. 당사는 서비스의 원활한 이용 및 운영을 위해 사전 고지 후 파트너의 수익금 적립 방법 및 출금 방법을 조정할 수 있습니다.

6. 당사는 회원이 미소 서비스를 이용함에 있어 안전하고 편리한 결제가 이루어질 수 있도록 자동결제를 제공할 수 있습니다. 자동결제 이용시 아래 각 호에 따릅니다.

① 당사는 회원이 자동결제 이용에 대한 동의를 하고 신용/체크카드 등 결제수단의 정보를 입력하는 경우 당해 홈서비스가 종료된 시점에 해당 신용카드/체크카드를 통해 별도의 인증과정 없이 결제를 하겠다는 의사표시를 한 것으로 봅니다.

② 결제 시점에 회원의 신용카드 등의 유효성, 한도, 계좌 잔액부족 등의 문제로 결제실패가 발생한 경우에 “미결제”로 처리되며, 미결제된 결제가 정상적으로 결제되기 전까지는 해당 회원은 해당 서비스의 이용이 제한 됩니다.

③ 자동결제에 사용되는 결제 수단은 신용/체크카드 또는 가상계좌이며, 결제정보는 해당 법령에 따라 결제 대행사에만 제공되며, 당사에는 저장되지 않습니다.

④ 신용카드, 가상계좌 등 자동결제는 각각 결제 대행사 NICE페이먼츠㈜, 주식회사 카카오페이(이하’ 결제 대행사’라함)에서 대행합니다.

⑤ 결제 시점에 시스템 장애로 인하여, 결제가 실패하거나 지연이 된 경우에는 시스템 정상화가 된 시점에 결제를 진행합니다.

7. 미결제가 발생한 경우 아래 각 호에 따릅니다.

① 서비스 정책에 따라 내부적으로 결제시도를 진행합니다. 미결제로 인한 결제 시도 시에는 회원에게 별도로 고지를 하지 않습니다.

② 미결제가 발생한 경우 회원이 탈퇴를 원하더라도 미결제금이 결제되기 전까지 탈퇴 할 수 없습니다.

③ 서비스 정책에 따라 미결제가 장기간 발생했을 경우에는 미소 서비스 전체에 대한 이용이 제한될 수 있습니다.

제 10 조(환급)
1. 회원의 귀책사유 없이 시스템 오류 등 정상적으로 당사의 서비스를 이용하지 못하거나 초과결제⬝중복결제 등의 문제가 발생한 경우, 회사는 해당 서비스의 정상적인 이용을 전제로 부과된 이용요금 또는 잘못 결제된 이용요금, 취소수수료의 전부 또는 일부를 해당 회원에게 환급합니다.

2. 당사는 회원이 지불한 결제수단과 동일한 수단으로 환급합니다. 다만, 당사가 동일한 수단으로 환급이 불가능한 경우 현금 등 다른 수단으로 환급할 수 있습니다.

3. 회원이 홈서비스 이용료의 적정성에 대한 이의를 제기하거나 환급 요청을 하고자 하는 경우 직접 거래당사자에 하거나 회사를 통해 요청할 수 있습니다.

제 11 조(손해 배상)
1. 당사는 고객과 파트너 간 계약의 중개자로서 고객과 파트너 간의 분쟁이 발생한 경우, 원칙적으로 관련 당사자 간에 해결해야 합니다. 당사는 고객과 파트너 간의 적극적 중재역할을 담당할 뿐입니다.

2. 사고나 손해를 포함해 서비스에 문제가 발생한 사안에 대한 접수는 서비스 종료 후 72시간 내에 이뤄져야 당사가 배상을 중재합니다. 고객 또는 파트너는 접수를 할 때 근거 자료를 당사에 제공하여야 합니다.

3. 서비스를 제공한 파트너가 자신의 책임을 인정하지 않을 경우 입증책임은 고객에게 있으며, 책임이 확인되지 않은 경우는 당사가 배상을 중재하지 않습니다.

4. 직거래 등 당사를 통하지 않거나 사전 협의 또는 반영되지 않은 서비스에서의 문제는 당사에 접수할 수 없습니다.

5. 당사는 어떠한 경우에도 회원의 정신적 손해배상과 당사가 알지 못하는 특별 손해를 배상하지 않으며 배상을 중재하지 않습니다.

6. 파트너의 태도 및 응대 부족으로 인해 고객이 불만족한 경우에는 파트너 교체를 원칙으로 하며 별도로 손해배상을 하지는 않습니다.

7. 파트너의 서비스 품질이 미흡한 경우 당사는 고객에게 아래에 따라 배상을 중재하거나 보상합니다.

① 검수를 요하는 홈서비스의 경우 고객의 사유로 검수가 진행되지 않았다면 당사에 접수할 수 없습니다. 고객이 부재 시 서비스가 이루어진 경우에는 SMS 또는 사진으로 고객이 검수를 한 경우여야 합니다.

② 고객은 서비스 품질 미흡으로 인한 배상요구를 접수할 경우 불만족한 서비스 관련 사진 및 근거 자료를 제공하여야 합니다.

③ 고객이 제공한 서비스 환경과 설비 또는 장비가 열악하거나 서비스 범위를 벗어나는 요청사항으로 파트너의 책임이 인정되지 않을 경우 배상을 중재하거나 보상하지 않습니다.

④ 파트너의 서비스 품질 미흡으로 당사의 배상이 진행될 경우, 고객의 접수 내용에 따라 파트너에게 지급되는 파트너 최종 정산금액이 차감될 수 있습니다.

8. 고객이 미소 서비스를 이용하는 과정에서 파손사고가 발생하였을 경우 아래에 따라 처리합니다.

① 파트너의 과실로 파손사고가 발생하였을 경우, 파트너는 이 약관 및 한국소비자보호원의 피해배상 규정에 따라 고객에게 금전으로 통상손해를 배상합니다.

② 당사는 파트너에게 원상회복을 지시하지 아니하며 고객의 물품 구입시기를 고려하여 감가상각 후 산정된 배상금액을 금전으로 배상하도록 중재합니다. 예컨대, 유리제품이 파손되어도 동일한 제품으로 배상하는 것이 아니며, 구매시기를 고려하여 감가상각 후 산정된 배상금액을 금전으로 배상하도록 중재합니다.

③ 당사는 고객이 영수증 등의 증빙자료와 파손 현장 사진이 첨부되지 않은 사고접수를 한 건에 관해서는 배상을 중재하지 않습니다.

9. 고객이 미소 서비스를 이용하는 과정에서 도난 및 분실사고가 발생하였을 경우 아래에 따라 처리합니다.

① 귀중품(귀금속, 현금 등)의 도난 분실은 입증이 어렵기 때문에 1차적으로 고객이 안전하게 보관하여야 하며 당사는 원칙적으로 책임이 없습니다.

② 도난 사고 접수 시 당사는 고객의 수사기관 의뢰에 적극적으로 협조합니다.

10. 파트너의 지각 또는 노쇼로 정해진 서비스 이행이 어려울 경우 서비스 시간의 변경 통한 서비스 이행 또는 재접수/매칭을 통한 서비스 이행 재시도를 원칙으로 합니다.

11. 고객의 예약 또는 견적 요청에 응하는 파트너가 없어 서비스가 지연되거나 수행되지 못하는 경우, 당사는 서비스 시간의 변경 통한 서비스 이행 또는 재접수/매칭을 통한 서비스 이행 재시도를 원칙으로 하며 별도로 손해배상을 하지는 않습니다. 중개될 가능성이 없는 경우 서비스 진행을 중지할 수 있습니다.

12. 회원의 고의 또는 과실에 의해 서비스 진행이 어렵거나 확정된 서비스의 취소 시점이 늦는 경우 취소수수료가 발생할 수 있으며 이는 별도 고지합니다.

13. 회원이 불법행위나 고의 또는 과실에 의한 본 약관 위반행위로 인하여 당사가 다른 회원 또는 제3자로부터 손해배상청구 또는 사실상 또는 법률상 이의제기를 당하는 경우 등에는 그 문제의 발생에 있어 그로 인한 책임 일체에 대하여 회원은 자신의 책임과 비용으로 회사를 면책시키고 이로 인해 발생한 회사의 모든 손해 및 비용 일체를 배상하여야 합니다.

제 12 조(면책조항)
1. 당사는 다음 각 호를 포함하여 당사의 고의 또는 과실 없이 서비스를 제공할 수 없는 경우 이로 인하여 회원에게 발생한 손해에 대해서는 책임을 부담하지 않습니다.

① 천재지변 또는 이에 준하는 불가항력으로 인해 서비스를 제공할 수 없는 경우

② 회원의 귀책사유로 서비스 이용에 장애가 있는 경우

2. 당사는 통신판매중개업자로서 회원들 간 발생한 거래와 관련된 손해에 관하여 당사의 고의 또는 중대한 과실이 있는 경우를 제외하고는 책임을 부담하지 않습니다.

3. 당사는 서비스 개편이나 운영상 또는 당사의 긴박한 상황 등에 의해 서비스 전부나 일부를 중단할 필요가 있는 경우 서비스의 제공을 중단할 수 있습니다.

4. 당사는 상당한 주의를 기울여 회원의 정보를 취급하고 이를 전달합니다. 당사는 서비스에 필요한 정보 중 회원으로부터 받은 그대로의 정보를 제공하는 것을 원칙으로 하고, 각 회원이 제공한 정보의 진실성, 완전성, 적법성 및 타인의 권리에 대한 비침해성 등 일체에 대하여 보증하지 아니하며, 이와 관련한 일체의 위험과 책임은 법률에 따라 당사가 책임지는 경우를 제외하고는 각 회원이 부담합니다.

5. 당사는 다음 내용과 관련하여서는 당사의 고의 또는 중대한 과실이 없는 한 이에 대해 책임을 지지 않습니다.

① 회원이 이 약관 규정을 위배하여 발생한 손해

② 회원이 작성한 정보서 본인이 확인 가능한 전자우편이 아니거나 연락처 갱신을 하지 않아 당사가 전달하는 공지사항이 전자우편과 SMS 또는 어플리케이션 알림을 통해 전달되지 못하여 발생하는 손해

③ 당사의 서비스와는 별개로 회원 간 혹은 회원과 제3자간 온라인 및 오프라인상에서 이루어진 행위

6. 당사의 동의 없이 제3자에게 계정 정보 또는 회원의 권한을 판매 및 양도할 경우 회원 자격 박탈, 민사상 손해배상 청구 및 형사상의 고소 또는 고발을 할 수 있습니다. 또한 회원 권한 판매 및 양도로 인한 모든 손해는 권한을 판매/양도한 회원이 부담합니다.

제 13 조(개인정보처리방침)
개인정보보호에 관한 사항은 당사의 웹사이트 또는 모바일 어플리케이션에 게시된 당사의 개인정보처리방침에 규정된 내용에 따릅니다.

제 14 조(당사의 의무)
1. 당사는 법령과 이 약관이 금지하거나 공공의 질서와 선량한 풍속에 반하는 행위를 하지 않으며 이 약관이 정하는 바에 따라 지속적이고 안정적으로 서비스를 제공하는 데 최선을 다합니다.

2. 당사는 회원이 안전하게 미소 서비스를 이용할 수 있도록 회원의 개인정보(신용정보 포함)보호를 위한 노력을 다합니다.

3. 당사는 정기적으로 회원에게 당사의 서비스 내용 및 이용 안내에 대한 정기적인 서신(공지, SMS, 전자우편, 어플리케이션 알림 등)을 보냅니다.

4. 당사는 회원이 제기하는 정당한 의견이나 불만을 반영하고 그 손해를 해결하기 위해 노력합니다.

제 15 조(회원의 계정 정보 및 비밀번호에 대한 의무)
1. 회원 계정과 비밀번호에 관한 관리책임은 회원에게 있습니다. 이에 대해 당사는 관련 법령에 별도의 규정이 있거나 당사에게 고의 또는 과실이 있는 경우에 한하여 책임을 부담합니다.

2. 회원은 자신의 계정 및 비밀번호를 제 3 자에게 이용하게 해서는 안 됩니다.

3. 회원이 자신의 계정 및 비밀번호를 도난당하거나 제 3 자가 사용하고 있음을 인지한 경우에는 바로 당사에 통보하고 당사의 안내가 있는 경우에는 그에 따라야 합니다.

제 16 조(회원의 의무)
1. 회원은 당사와의 거래 전에 반드시 거래 조건을 정확하게 확인한 후 거래를 하여야 합니다. 회원이 거래 내용과 거래 조건을 확인하지 않고 거래를 진행함으로 인해 발생한 손해는 회원이 부담합니다.

2. 회원은 이 약관 및 당사가 서비스와 관련하여 고지하는 내용을 준수하여야 하며, 약관 및 고지내용을 위반하거나 이행하지 아니하여 발생하는 모든 손해에 관하여는 회원이 책임을 부담합니다.

3. 당사는 파트너와 고객를 중개하는 역할이므로 파트너와 고객은 스스로의 책임 하에 거래를 진행하여야 합니다.

4. 파트너가 서비스 중 발생시킨 문제의 책임은 원칙적으로 파트너에게 귀속됩니다.

5. 회원은 대금을 지급함에 있어 반드시 본인이 합법적 권한을 가진 결제수단을 사용하여야 하며, 타인의 결제수단을 임의로 사용 하여서는 안됩니다. 타인의 결제수단을 임의 사용함으로써 발생하는 당사 및 결제수단의 적법한 소유자, 결제대행사에게 발생하는 손해는 해당 고객이 부담합니다.

6. 회원이 직접 입력한 정보는 진실하여야 하며 만일 회원이 허위 기타 부정한 정보를 입력하여 다른 회원에게 피해가 발생할 경우 그에 대한 민, 형사상의 책임을 포함한 일체의 책임은 회원 본인에게 귀속됩니다.

7. 회원은 당사가 유료서비스를 안전하게 제공할 수 있도록 당사에 협조하여야 하며, 당사가 회원의 약관 위반행위를 발견하여 회원에게 해당 위반 행위에 대하여 소명을 요청할 경우 회원은 당사의 요청에 적극 응하여야 합니다.

8. 회원은 당사가 정하고 인정하는 방식에 따라 예치금, 쿠폰 등을 사용하여야 합니다.

9. 미성년자인 회원이 법정대리인의 동의 없이 거래 또는 결제를 진행하는 경우 본인 또는 법정대리인이 이를 취소할 수 있습니다.

10. 회원은 아래 각 호에 해당하는 행위를 해서는 안됩니다. 아래 각 호에 해당하는 행위를 한 회원은 제7조 제2항 이하에 따라 회원 자격이 제한되거나 정지될 수 있으며 민, 형사상의 책임을 지게 됩니다.

① 당사의 회원정보를 부정하게 취득하는 행위

② 당사의 인터넷 웹사이트 및 모바일 어플리케이션을 해킹하거나 유사 프로그램을 이용하여 정상적인 운영을 어렵게 하는 행위(해킹 또는 바이러스 유포, D-dos 공격 등)

③ 타인의 계정과 비밀번호를 도용하는 행위

④ 개인정보를 허위 또는 타인의 것으로 등록하는 행위

⑤ 상대방에 대한 비방 또는 인격모독을 하거나 이를 작성 및 유포하는 행위

⑥ 공공질서, 미풍양속에 저해하는 저작물을 등록 또는 유통시키는 행위

⑦ 사이트 내 또는 서비스 과정에서 불법적으로 물건을 판매하거나 상행위를 하는 행위

⑧ 당사가 제공하는 프로필 및 개인정보(키워드, 사진, 이름, 연락처 등)을 무단 캡쳐(저장)하는 행위 및 이를 유출하여 외부에 게시하는 경우

⑨ 당사나 타회원에 대한 허위 사실을 유포하거나 업무방해를 하는 행위

11. 당사 회원의 권한은 본인이 아닌 타인에게 양도 및 판매가 불가능합니다.

12. 회원이 작성할 수 있는 서비스 내의 모든 영역에 일체의 개인 정보(전자우편, 전화번호)등을 기재하는 방법으로 연락처를 공개하면 당사 서비스를 부정하게 이용하는 행위로 간주하여 강제 탈퇴 처리될 수 있으며 이로 인한 손해에 대해 당사는 책임지지 않습니다.

13. 회원은 서비스를 이용함에 따라 열람한 각 회원의 개인 정보 등을 해당 회원의 동의 없이 제3자와 공유하거나 제3자에게 이전하여서는 아니됩니다.

14. 당사는 회원의 법령 위반, 이 약관 위반 기타 금지행위 여부에 대한 모니터링을 실시하고 있으며, 회원은 회사의 모니터링 업무에 협조하여야 합니다.

제 17 조(저작권의 귀속 및 이용제한)
1. 당사가 작성한 저작물에 대한 저작권, 기타 지적재산권은 당사에 귀속됩니다.

2. 회원은 당사를 이용함으로써 얻은 정보 중 당사에게 지적재산권이 귀속된 정보를 당사의 사전승낙 없이 복제, 송신, 출판, 배포, 방송, 기타 방법에 의하여 영리목적으로 이용하거나 제 3 자에게 이용하게 하여서는 안 됩니다.

3. 당사는 약정에 따라 회원에게 귀속된 저작권을 사용하는 경우 해당 회원에게 통보하여야 합니다.

제 18 조(회원의 게시물 및 저작권)
1. 게시물이라 함은 회원이 서비스를 이용하면서 게시한 글, 사진, 각종 파일과 링크 등을 말합니다.

2. 회원의 게시물에 의한 손해나 기타 문제가 발생하는 경우, 회원은 이에 대한 책임을 지게 되며, 당사는 책임을 지지 않습니다.

3. 당사는 다음 각 호에 해당하는 게시물 등을 회원의 사전 동의 없이 임의 게시, 중단, 수정, 삭제, 이동 또는 등록 거부 등의 관련 조치를 할 수 있습니다.

① 다른 회원 또는 제 3 자에게 심한 모욕을 주거나 명예를 손상시키는 내용인 경우

② 공공질서 및 미풍양속에 위반되는 내용을 유포하거나 링크시키는 경우

③ 불법복제 또는 해킹을 조장하는 내용인 경우

④ 제 3 자의 저작권을 침해하여 게시중단 요청을 받은 경우

⑤ 영리를 목적으로 하는 광고일 경우

⑥ 범죄와 결부된다고 객관적으로 인정되는 내용일 경우

⑦ 다른 회원 또는 제 3 자의 저작권 등 기타 권리를 침해하는 내용인 경우

⑧ 사적인 정치적 판단이나 종교적 견해의 내용으로 당사가 서비스 성격에 부합하지 않는다고 판단하는 경우

⑨ 당사에서 규정한 게시물 원칙에 어긋나거나, 게시판 성격에 부합하지 않는 경우

⑩ 기타 관계법령에 위배된다고 판단되는 경우

4. 회원이 게시한 게시물의 저작권은 게시한 회원에게 귀속됩니다. 단, 당사는 서비스의 운영, 전시, 홍보의 목적으로 회원의 별도 허락 없이 무상으로 저작권법에 규정하는 공정한 관행에 합치되게 회원의 게시물을 사용할 수 있습니다.

5. 당사는 전항 이외의 방법으로 회원의 게시물을 이용하고자 하는 경우, 전화, 팩스, 전자우편 등의 방법을 통해 사전에 회원의 동의를 얻어야 합니다.

6. 위 제4항에 따라, 회원의 저작물의 무상 사용 허락은 회원이 해당 콘텐츠를 삭제하면 효력을 상실합니다. 단, 회원이 삭제하기 전에 허용하였던 서비스의 운영에 필요하거나 법률에서 요구되는 경우에는 예외가 인정될 수 있습니다.

7. 회원이 이용계약 해지를 한 경우 타인에 의해 보관, 담기 등으로 재 게시 되거나 복제된 게시물과 타인의 게시물과 결합되어 제공되는 게시물, 공용 게시판에 등록된 게시물 등 서비스 운영에 필요하거나 법률에서 요구되는 경우에는 삭제되지 않습니다.

제 19 조(정보의 제공 및 광고의 게재)
1. 당사는 회원에게 서비스 이용에 필요하다고 인정되는 각종 정보에 대해서 웹사이트 및 이메일, SMS, DM 발송 등 각종 매체에 게재하는 방법 등으로 회원에게 제공할 수 있습니다.

2. 당사는 서비스 개선 및 소개 등을 목적으로 회원의 동의 하에 추가적인 개인정보를 요청할 수 있습니다.

3. 당사는 서비스의 운용과 관련하여 사이트, 이메일, SMS, DM 등에 광고 등을 게재할 수 있습니다.

제 20 조(세금신고 및 납세)
1. 당사는 세금신고에 참고할 서비스 금액에 대한 정산 자료를 파트너에게 제공함으로써 파트너의 세금 미신고분에 대한 책임을 지지 않습니다.

2. 개인사업자/법인사업자 등록을 소지한 파트너는 당사에서 제공하는 정산 자료를 참고하여 국세청 부가가치세 신고 시 누락되지 않도록 신고해야 합니다.

3. 사업자 등록을 소지하지 않은 개인 파트너는 다음과 같은 안내 사항을 확인하여 세금신고 시 누락이 되지 않도록 해야 합니다.

① 개인(자연인) 파트너는 대금정산이나 서비스 수행 건에 따라 국세청에서는 사업자로 판단될 수 있습니다. 전문가와의 상담(관할 세무서 민원실 또는 국세청 126)을 통해서 사업자등록 필요 여부를 확인해야 합니다.

② 상기의 안내를 기준으로 사업자등록을 해야 함에도 불구하고 이를 이행하지 않은 부분에 대해서는 본 당사는 어떠한 책임도 지지 않습니다.

4. 당사는 파트너와 고객의 중개 서비스를 수행하는 의무를 다하고자 요청 시 미소 서비스에서 체결되는 신용/체크카드결제, 가상계좌 거래에 대해 적격 증빙처리(세금계산서, 거래명세서, 현금영수증)를 제공합니다. 그러나 국세청으로 신고되는 적격증빙 대상 금액은 고객/파트너가 결제한 금액 중 파트너에게 지급되는 최종 정산금액을 제외한 고객 수수료 상당액만 발행됩니다.

제 21 조(분쟁해결)
1. 당사는 회원이 제기하는 정당한 의견이나 불만을 반영하고 그 피해를 보상처리하기 위하여 피해보상처리기구를 설치․운영합니다.

2. 당사는 이용자로부터 제출되는 불만사항 및 의견은 우선적으로 그 사항을 처리합니다. 다만, 신속한 처리가 곤란한 경우에는 이용자에게 그 사유와 처리일정을 즉시 통보해 드립니다.

3. 당사와 회원간에 발생한 전자상거래 분쟁과 관련하여 회원의 피해구제신청이 있는 경우에는 공정거래위원회 또는 시·도지사가 의뢰하는 분쟁조정기관의 조정에 따를 수 있습니다.

제 22 조(재판권 및 준거법)
1. 당사와 회원 간에 발생한 분쟁에 관한 소송의 관할은 민사소송법에 따라 정합니다.

2. 당사와 회원 간에 제기된 전자상거래 소송에는 한국법을 적용합니다.
'''
              ),
            ),
          ],
        ),
      ),
    );
  }
}
