

// ResponseDTO mUserResponseDTO = ResponseDTO(true, _mUser, null);
// ResponseDTO mUserListResponseDTO = ResponseDTO(true, _mUserList, null);

// User _mUser = User(1, "ssar@nate.com", "박서영", "01022222222", 1,
//     "2023-10-24 14:20:36.077", "2023-10-24 14:20:36.077");
//
// List<User> _mUserList = [
//   User(1, "choi@nate.com", "송재익", "01011111111", 1, "2023-10-24 14:20:36.077",
//       "2023-10-24 14:20:36.077"),
//   User(2, "park@nate.com", "박서영", "01022222222", 1, "2023-10-24 14:20:36.077",
//       "2023-10-24 14:20:36.077"),
//   User(3, "jang@nate.com", "장원용", "01033333333", 1, "2023-10-24 14:20:36.077",
//       "2023-10-24 14:20:36.077"),
//   User(4, "choi@nate.com", "최제인", "01044444444", 2, "2023-10-24 14:20:36.077",
//       "2023-10-24 14:20:36.077"),
//   User(5, "jo@nate.com", "조소현", "01055555555", 1, "2023-10-24 14:20:36.077",
//       "2023-10-24 14:20:36.077")
// ];